<script setup lang="ts">
const tariffs = ref([
  {
    name: 'Самое главное',
    price: '75 000',
    oldPrice: '80 000 ₽',
    points: [
        '2-3 Аниматора',
        'Продолжительность: 2-4 часа',
        'Фотосъемка',
        'Базовое звуковое оборудование',
        'Шоу программа из базового каталога',
        'Оформление шарами'
    ]
  },
  {
    name: 'Золотая середина',
    price: '200 000',
    oldPrice: '225 000 ₽',
    points: [
      '2-3 Аниматора',
      'Продолжительность: 2-4 часа',
      'Фотосъемка',
      'Базовое звуковое оборудование',
      'Шоу программа из базового каталога',
      'Оформление шарами',
      'Расширенный пакет оформления воздушными шарами',
      'Фотозона до 10 элементов декора',
      'Шоу-программа из авторского каталога',
      '1 добавка из расширенного каталога услуг',
      'Шоу-программа из авторского каталога',
      'Персональный ивент-менеджер на площадке'
    ]
  },
  {
    name: 'Возможно всё',
    price: '400 000',
    oldPrice: '450 000 ₽',
    points: [
      'Анимационная программа, квест или интерактивный спектакль с 4-7 героями',
      'Продолжительность: 4-7 часа',
      '1+ шоу-программа из базового каталога',
      '2+ шоу-программы из авторского каталога',
      'Расширенная премиум-фотозона до 20 элементов декора',
      'Расширенный пакет оформления воздушными шарами',
      'Фотосъемка',
      'Звуковое и световое оборудование',
      '2+ добавки из расширенного каталога услуг',
      'Оформление Candy-bar, тематические сладости и торт',
      'Тематическое оформление стола',
      'Персональный подбор площадки для мероприятия',
      'Персональный ивент-менеджер до и после мероприятия',
      'Электронные пригласительные стилизованные под тематику/оформление мероприятия',
    ]
  }
])
</script>

<template>
  <div class="tariffs">
    <h2 v-gsap.whenVisible.once.from='{ autoAlpha: 0, start: "top 80%", end: "bottom 10%"}'>Тарифы праздника</h2>
    <div class="tariffs__container container">
      <div class="tariffs__tariff" v-for="tariff in tariffs">
        <div class="tariffs__tariff-name">
          {{ tariff.name }}
        </div>
        <div class="tariffs__tariff-price">
          от {{ tariff.price }} ₽
        </div>
        <div class="tariffs__tariff-old-price">
          {{ tariff.oldPrice }}
        </div>
        <ul class="tariffs__tariff-points">
          <li v-for="point in tariff.points">
            {{ point }}
          </li>
        </ul>
        <div class="tariffs__tariff-button-container">
          <button class="button">Заказать</button>
        </div>
      </div>
    </div>
  </div>
</template>
